{
  "backend/main.mo": "Motoko canister managing products, purchases, sessions, and access control with initialization helpers and comparison modules.",
  "feature_evidence.json": "Report listing feature changes, involved files, components, and test IDs for frontend updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and behavior.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component routing users to login, shop, or admin pages with themed layout.",
  "frontend/src/components/Banner.tsx": "Empty placeholder file for a banner component.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, branding, and a caffeine.ai link with gradient styling.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app title, username, and logout functionality.",
  "frontend/src/components/ProductCard.tsx": "Displays product image, price, and status with a selectable button and sold‑out overlay.",
  "frontend/src/components/PurchaseDialog.tsx": "Dialog for viewing product details and submitting purchase requests with error handling.",
  "frontend/src/components/ThemeProvider.tsx": "Wrapper enabling system-based theme switching via next-themes.",
  "frontend/src/components/UserProfileSetup.tsx": "Empty placeholder file for a user profile setup component.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor tied to the user’s identity and triggering query invalidation.",
  "frontend/src/hooks/useCustomAuth.ts": "Zustand store managing simple username-based auth with persistence and allowed-user validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, identity loading, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for login, profiles, admin checks, and product operations with caching and error handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme tokens and ensuring consistent UI component backgrounds.",
  "frontend/src/lib/productImage.ts": "Utility resolving product image sources, preferring embedded data URLs and otherwise returning null.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and wraps the app with the InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing purchases and products, including creation, deletion, and image uploads.",
  "frontend/src/pages/LoginPage.tsx": "Username-based login screen validating allowed users and syncing backend and local auth states.",
  "frontend/src/pages/ShopPage.tsx": "Renders the shop page with tabs for normal and free products, fetching items by category and opening a purchase dialog on selection. Auto-refetches lists when the dialog closes and displays loading and empty states.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, and fonts with CSS variable–driven theming and enabling animation and typography plugins.",
  "project_state.json": "Describes the project’s current state, goals, architecture notes, known issues, and feature requirements for the shop app."
}