{
  "backend/main.mo": "Motoko canister managing products, purchases, sessions, user profiles, and access control with initial seeding and role‑based actions.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.html": "Basic HTML entry point loading the React app.",
  "frontend/src/App.tsx": "Root component routing between login, shop, and admin views based on auth state.",
  "frontend/src/components/Banner.tsx": "Empty placeholder component.",
  "frontend/src/components/Footer.tsx": "Footer with branding, dynamic year, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky header showing logo, username, and logout with query cache clearing.",
  "frontend/src/components/ProductCard.tsx": "Card UI for displaying product details, price, and view/sold‑out actions.",
  "frontend/src/components/PurchaseDialog.tsx": "Dialog for viewing product details and submitting purchase requests.",
  "frontend/src/components/ThemeProvider.tsx": "Wrapper enabling system‑based theme switching via next‑themes.",
  "frontend/src/components/UserProfileSetup.tsx": "Empty placeholder component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actor tied to identity and reinitializes queries on change.",
  "frontend/src/hooks/useCustomAuth.ts": "Zustand‑based auth store managing username login, admin flag, and persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for login, profile management, admin checks, and product retrieval, calling backend actor methods.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme CSS variables and component overrides, including Radix UI background fixes.",
  "frontend/src/lib/productImage.ts": "Returns a product's image data URL if available, otherwise null.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing purchases and products, including creation, deletion, and image upload.",
  "frontend/src/pages/LoginPage.tsx": "Username-based login page validating allowed users and triggering backend login via custom auth hooks.",
  "frontend/src/pages/ShopPage.tsx": "Shop interface displaying products by category and showing purchase dialog, with auto-refetch on close.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode via class, custom theme extensions for colors, border radius, fonts, and includes animate and typography plugins.",
  "project_state.json": "Defines project state for removing all backend authentication and authorization, listing related feature requests and architectural notes."
}