{
  "backend/main.mo": "Motoko canister managing products, purchases, sessions, and access control with initialization logic and predefined products.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, affected files, and confidence ratings.",
  "frontend-file-summaries.txt": "Collected summaries describing the purpose of various frontend files including pages, components, and hooks.",
  "frontend/index.html": "Base HTML bootstrap mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App always renders the discontinued LoginPage and notification toasts with authentication disabled.",
  "frontend/src/components/Banner.tsx": "Empty placeholder file for a banner component.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright info and a caffeinated.ai attribution link with gradient styling.",
  "frontend/src/components/Header.tsx": "Header showing the shop logo, username, optional admin badge, and logout button.",
  "frontend/src/components/ProductCard.tsx": "Displays product details with image, price, and sold-out overlay along with a select button.",
  "frontend/src/components/PurchaseDialog.tsx": "Modal dialog showing product details and sending purchase requests with loading and sold‑out handling.",
  "frontend/src/components/ThemeProvider.tsx": "Wraps children in next-themes provider enabling system-based dark/light mode.",
  "frontend/src/components/UserProfileSetup.tsx": "Empty file intended for a user profile setup component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity and invalidates related queries on change.",
  "frontend/src/hooks/useCustomAuth.ts": "Zustand store for simple username-based auth with persistence and allowed-user checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context using Dfinity AuthClient with login, clear, and status handling.",
  "frontend/src/hooks/usePurchaseRequestVisibility.ts": "Zustand store that tracks hidden purchase request IDs with persistence support.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching products and purchases and performing purchase-related mutations.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables, dark mode tokens, and utility animations.",
  "frontend/src/lib/productImage.ts": "Utility that returns a product’s image data URL or null if unavailable.",
  "frontend/src/main.tsx": "App entry mounting React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for managing purchases and products, including creation, review, and deletion.",
  "frontend/src/pages/LoginPage.tsx": "Login page displaying discontinued notice with disabled authentication.",
  "frontend/src/pages/ShopPage.tsx": "React page that fetches and displays normal and free products in tabbed grids, manages a selected product, and auto-refetches when dialogs close.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, fonts, and enabling animation and typography plugins.",
  "project_state.json": "JSON describing the project’s discontinued state, listing existing features and a pending request related to login-screen discontinuation behavior."
}