{
  "kind": "build_request",
  "title": "Discontinue shop notice on login and disable sign-in",
  "projectName": "Discontinued Shop Notice",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a horizontally scrolling yellow banner to the top of the Login screen that displays a German discontinuation notice stating the shop is discontinued and will not be worked on anymore.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a scrolling yellow banner at the top of the login screen which in your own way/text says that the shop is discontinued and will not be worked on anymore (make the text german"
        ]
      },
      "acceptanceCriteria": [
        "When the login screen renders, a full-width yellow banner is pinned at the top of the login view.",
        "The banner text scrolls horizontally (marquee-style) continuously.",
        "The banner message text is in German and clearly communicates the shop is discontinued and will not be worked on anymore.",
        "The banner remains readable in both light and dark mode (sufficient contrast)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Disable logging in from the Login screen so users cannot sign in (no successful login via button click or Enter key).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "disable logging in"
        ]
      },
      "acceptanceCriteria": [
        "The login form cannot trigger any login action (no backend login mutation call is executed).",
        "Login controls (input and submit button) are visually disabled and non-interactive, or replaced with a clear disabled-state UI.",
        "Pressing Enter in the username field does not log the user in.",
        "No route or UI path allows a non-authenticated user to enter the Shop or Admin pages."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure previously persisted client auth state cannot be used to bypass the discontinued state (if a user is already authenticated in local storage, they should be forced to a non-authenticated/discontinued login view).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "disable logging in"
        ]
      },
      "acceptanceCriteria": [
        "If auth state is persisted as authenticated (e.g., from prior sessions), the app does not render ShopPage/AdminPage and instead shows the discontinued login experience.",
        "Any displayed logout/clear action results in the app remaining on the discontinued login experience with sign-in disabled."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement a cohesive 'discontinued/caution' visual theme for the login discontinuation experience (typography, spacing, and banner styling) consistent with the existing warm orange/amber palette; do not introduce blue/purple as primary accents.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a scrolling yellow banner at the top of the login screen"
        ]
      },
      "acceptanceCriteria": [
        "The discontinued login view looks intentional and consistent (banner, card, and any explanatory text share a unified style).",
        "Primary accents stay within warm amber/yellow/orange tones; no blue/purple dominant accents are introduced."
      ]
    }
  ],
  "constraints": [
    "All user-facing text in this build request must be written in English (the banner content itself must remain German).",
    "Do not edit any files under frontend/src/components/ui (compose them only).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend remains single-actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Removing or changing backend authorization/role checks in Motoko.",
    "Rebuilding or expanding shop/admin functionality (products, purchases, accept/decline flows).",
    "Adding new authentication providers beyond the existing app setup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}