{
  "kind": "build_request",
  "title": "Remove all backend authorization checks so every method is callable without authentication",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all backend authorization/permission enforcement so that no canister method traps or rejects based on caller identity or role. Specifically, delete the AccessControl-based guards and any \"Unauthorized\" traps from all methods that currently check admin/user permissions (e.g., purchase admin actions, product admin actions, and user profile methods).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-8",
          "msg-10",
          "msg-11"
        ],
        "quotes": [
          "the backend auth requests for everything are actually back... could you remove them all?",
          "you want every backend authentication requirement removed so the backend no longer checks caller identity for any method",
          "Yes",
          "Apply"
        ]
      },
      "acceptanceCriteria": [
        "Calling acceptPurchase/declinePurchase/deleteConfirmedPurchase/addProduct/deleteProduct/getCallerUserProfile/getUserProfile/saveCallerUserProfile no longer traps with any \"Unauthorized\" error for any caller.",
        "No backend method performs role/permission checks that can block the call based on caller identity."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend still compiles and the public Candid interface remains usable by the existing frontend after removing authorization checks (i.e., keep method names and parameter/return types compatible unless strictly necessary). If any AccessControl-only endpoints become unnecessary, either keep them as non-enforcing/no-op helpers or adjust them in a way that does not break the current frontend build.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-11"
        ],
        "quotes": [
          "If yes, I’ll strip all `shared(msg)` auth checks and replace them with plain public functions so nothing requires authentication anymore.",
          "Apply"
        ]
      },
      "acceptanceCriteria": [
        "Backend canister builds successfully after changes.",
        "Frontend can still generate an actor and call the same backend methods it currently calls without type mismatches at build time.",
        "No changes introduce new authentication requirements."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Use English for any user-facing text (including error messages that remain)."
  ],
  "nonGoals": [
    "Do not add new authentication systems or third-party auth providers.",
    "Do not add new features unrelated to removing backend authorization checks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}