{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend updates for authless buy/create flows and fully opaque UI surfaces",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Ensure product creation and purchase request UI does not rely on frontend-side authorization checks and surfaces backend errors verbatim in English.",
      "acceptanceCriteria": [
        "A non-admin user can submit the Admin page product creation form and the product is created successfully (assuming the user can access the page in the current routing).",
        "A user can send a purchase request from the purchase dialog without being blocked by frontend-side authorization checks.",
        "If the backend returns an error for purchase/product creation (e.g., sold out, product not found), the toast/dialog surfaces the backend error message in English without substituting obsolete authorization-specific messaging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the buy/create product mutations to display backend-provided failure messages without any role/auth-based client-side blocking. Use the authorization component only for role-based routing/guarding where it already exists, but do not gate calling addProduct(...) or buyProduct(...) on isAdmin/isAuthenticated in the UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/errorMessage.ts",
          "operation": "create",
          "description": "Add a small shared helper to normalize unknown thrown values into an English user-facing message (prefer the backend-provided message string; avoid replacing it with authorization-specific text)."
        },
        {
          "path": "frontend/src/components/PurchaseDialog.tsx",
          "operation": "modify",
          "description": "Ensure the purchase dialog UX never performs client-side authorization gating before calling the buy mutation, and that any surfaced error text aligns with the backend error message (no obsolete \"Unauthorized/Please log in\" substitutions)."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Ensure the Create Product form can submit regardless of user role (if the user can reach this page), while keeping other admin-only management actions (accept/decline/delete) guarded if the page is ever accessible to non-admins. Use the authorization component’s role concept only for guarding non-core admin actions; do not block addProduct(...) from the UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Make all dialogs/menus/overlays render with solid, non-transparent backgrounds without editing shadcn UI source components.",
      "acceptanceCriteria": [
        "The Admin \"Create Product\" dialog content renders with a solid (opaque) background in both light and dark mode.",
        "The Shop product view/purchase dialog content renders with a solid (opaque) background in both light and dark mode.",
        "No dialog/menu/overlay content in the app appears visually transparent (i.e., underlying page elements are not visible through the content surface).",
        "Changes do not require editing any files under `frontend/src/components/ui` (compose via props/classNames or add safe global CSS overrides elsewhere)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Set explicit opaque background classes on the Create Product DialogContent and any menu-like popovers used in the admin flow (e.g., SelectContent) via props/className overrides; do not edit `frontend/src/components/ui/*`."
        },
        {
          "path": "frontend/src/components/PurchaseDialog.tsx",
          "operation": "modify",
          "description": "Set explicit opaque background classes on the Shop product view/purchase DialogContent via props/className overrides; do not edit `frontend/src/components/ui/*`."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove translucent header surface styling (e.g., alpha backgrounds/backdrop blur) so overlay-like UI does not appear transparent over page content, while keeping the existing layout and navigation."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add safe global CSS overrides (not in `frontend/src/components/ui`) to enforce fully opaque backgrounds for Radix/shadcn popover/menu/dialog content surfaces where className composition is insufficient, ensuring both light and dark mode remain solid."
        }
      ]
    }
  ]
}